{
  "pages": [
    {
      "name": "Wie sicher ist mein Passwort?",
      "imgLink": "https://images.pexels.com/photos/2882630/pexels-photo-2882630.jpeg",
      "description": "Ein sicheres Passwort, das niemand so leicht erraten kann, ist sehr wichtig.",
      "owner": "teacher2",
      "writer": ["teacher1"],
      "reader": ["teacher3", "student2", "student3"],
      "content": [
        {
          "name": "Warum ist das so wichtig?",
          "type": "1",
          "content": "Bestimmt hast du dich schon einmal irgendwo angemeldet, wo du nach einem Passwort gefragt worden bist. Du brauchst ein Passwort, um Informationen vor anderen Menschen zu schützen. Es ist wie ein Schlüssel für den Computer und das Internet. Wenn du dich bei einer Kinderseite anmeldest oder registriert, musst du ein Passwort eingeben. Wichtig ist dabei, dass es schwer zu erraten ist und niemand außer deiner Eltern das Passwort kennt. Gäbe es keine Passwörter, könnte sich jeder mit dem Account eines anderen anmelden und unter dessen Namen im Internet surfen und E-Mails verschicken."
        },
        {
          "name": "Was ist ein sicheres Passwort?",
          "type": "1",
          "content": "<p>Um ausreichend Schutz zu bieten, sollte dein persönliches Kennwort die folgenden Merkmale erfüllen:<p> <p>1. <strong>Es hat mindestens 8 Zeichen.</strong></p><p>2. <strong>Es enthält Groß- und Kleinbuchstaben, Zahlen und Sonderzeichen (wie z. B. +, / oder ?).</strong></p><p>3. <strong>Es kommen darin keine persönlichen Daten vor (wie z. B. dein Name oder dein Geburtsdatum).</strong></p><p>4. <strong>Es ist geheim. Du solltest es also niemandem verraten.</strong></p><p>5. <strong>Es ist nirgendwo aufgeschrieben. Du solltest es dir also gut merken können.</strong></p>"
        },
        {
          "name": "Was ist ein sicheres Passwort? Part 2",
          "type": "3",
          "content": "https://www.youtube.com/watch?v=1lVqVVgkxYE"
        },
        {
          "name": "Eine kleine Merkhilfe",
          "type": "1",
          "content": "<p>Es ist nicht immer ganz einfach, ein gutes Passwort zu finden. Denn auf der einen Seite soll es für andere nicht so leicht zu erraten sein, auf der anderen sollst du es dir dennoch gut merken können. Eine Eselsbrücke kann da helfen. Denk dir einen Satz aus, mit dessen Hilfe du dir dein Passwort gut behalten kannst. Hier ein paar Beispiele:</p><p>Ich habe beim Weitwurf den 2. Platz gemacht! > Passwort: IhbWd2Pg!</p><p>99 Luftballons - auf ihrem Weg zum Horizont > Passwort: 99L-aiWzH</p><p>Ist am 3. Oktober Tag der Deutschen Einheit? > Passwort: Ia3OTdDE?</p>"
        },
        {
          "name": "Passwörter und Pizza?",
          "type": "2",
          "content": "https://www.bsi.bund.de/SharedDocs/Bilder/DE/BSI/Aktuell/Sicheres_Passwort_passwoerter_merken_pizza.jpg?__blob=poster&v=1"
        }
      ]
    },
    {
      "name": "Wer schreibt mir denn da?",
      "imgLink": "https://www.internetmatters.org/connecting-safely-online/wp-content/uploads/sites/2/2020/06/Parents-Strangers.png",
      "description": "Im Internet können die Leute hinter den Nachrichten ganz anders sein als du denkst. Deshalb solltest du immer aufpassen, was du im Internet schreibst.",
      "owner": "teacher1",
      "writer": ["teacher2"],
      "reader": ["teacher3", "student1", "student3"],
      "content": [
        {
          "name": "Warum ist das so wichtig?",
          "type": "1",
          "content": "<p>Im Internet kannst du mit vielen Menschen in Kontakt treten. Du kannst mit ihnen chatten, mit ihnen spielen oder mit ihnen über deine Hobbys und Interessen sprechen. Das ist toll, denn so kannst du neue Freunde finden. Aber du musst auch aufpassen, was du im Internet schreibst."
        },
        {
          "name": "Wie finde ich heraus wer das ist?",
          "type": "1",
          "content": "<p>Wenn du im Internet mit anderen Menschen in Kontakt trittst, solltest du immer aufpassen, wer das ist. Denn es gibt viele Menschen, die sich im Internet als jemand anderes ausgeben. Sie wollen zum Beispiel, dass du ihnen Geld schickst oder dass du ihnen deine persönlichen Daten verrätst. Deshalb solltest du immer aufpassen, was du im Internet schreibst.</p>"
        },
        {
          "name": "Wie funktioniert das im Interent?",
          "type": "3",
          "content": "https://www.youtube.com/watch?v=i7cYePelQH4"
        },

        {
          "name": "Erkenne ich die richtige Person?",
          "type": "1",
          "content": "<p>Hier wird es ein Spiel zur Überprüfung des Lernerfolges geben. Darin werden leichtere und schwerere Fragen gestellt und das Kind kann sich damit Punkte erspielen.</p>"
        }
      ]
    },
    {
      "name": "Was sind Passwörter?",
      "imgLink": "https://fpmedia.at/master/password1.png",
      "description": "Jeder spricht immer über Passwörter, aber was ist das eigentlich und wozu werden die verwendet?",
      "owner": "teacher2",
      "writer": ["teacher1"],
      "reader": ["teacher3", "student2", "student3"],
      "content": [
        {
          "name": "Was weißt du schon über Passwörter?",
          "type": "4",
          "content": "https://app.Lumi.education/run/7nLb4h"
        },
        {
          "name": "Warum sind sichere Passwörter so wichtig?",
          "type": "1",
          "content": "Bestimmt hast du dich schon einmal irgendwo angemeldet, wo du nach einem Passwort gefragt worden bist. Du brauchst ein Passwort, um Informationen vor anderen Menschen zu schützen. Es ist wie ein Schlüssel für den Computer und das Internet. Wenn du dich bei einer Kinderseite anmeldest oder registriert, musst du ein Passwort eingeben. Wichtig ist dabei, dass es schwer zu erraten ist und niemand außer deiner Eltern das Passwort kennt. Gäbe es keine Passwörter, könnte sich jeder mit dem Account eines anderen anmelden und unter dessen Namen im Internet surfen und E-Mails verschicken."
        },
        {
          "name": "Was ist ein sicheres Passwort?",
          "type": "1",
          "content": "Um ausreichend Schutz zu bieten, sollte dein persönliches Kennwort die folgenden Merkmale erfüllen:<p> <p>1. <strong>Es hat mindestens 8 Zeichen.</strong></p><p>2. <strong>Es enthält Groß- und Kleinbuchstaben, Zahlen und Sonderzeichen (wie z. B. +, / oder ?).</strong></p><p>3. <strong>Es kommen darin keine persönlichen Daten vor (wie z. B. dein Name oder dein Geburtsdatum).</strong></p><p>4. <strong>Es ist geheim. Du solltest es also niemandem verraten.</strong></p><p>5. <strong>Es ist nirgendwo aufgeschrieben. Du solltest es dir also gut merken können.</strong></p>"
        },
        {
          "name": "Was ist ein sicheres Passwort?",
          "type": "3",
          "content": "https://www.youtube.com/watch?v=1lVqVVgkxYE"
        },
        {
          "name": "Was ist ein sicheres Passwort?",
          "type": "4",
          "content": "https://app.Lumi.education/run/N99gGo"
        },
        {
          "name": "Spiel zur Merkhilfe",
          "type": "4",
          "content": "https://app.Lumi.education/run/semYUf"
        },
        {
          "name": "Hier kannst du das Bild nochmal genauer betrachten",
          "type": "2",
          "content": "https://fpmedia.at/master/PizzaGrafik.png"
        },

        {
          "name": "Merkhilfe für Passwörter",
          "type": "1",
          "content": "<p>Es ist nicht immer ganz einfach, ein gutes Passwort zu finden. Denn auf der einen Seite soll es für andere nicht so leicht zu erraten sein, auf der anderen sollst du es dir dennoch gut merken können. Eine Eselsbrücke kann da helfen. Denk dir einen Satz aus, mit dessen Hilfe du dir dein Passwort gut behalten kannst. Hier ein paar Beispiele:</p><p>Ich habe beim Weitwurf den 2. Platz gemacht! > Passwort: IhbWd2Pg!</p><p>99 Luftballons - auf ihrem Weg zum Horizont > Passwort: 99L-aiWzH</p><p>Ist am 3. Oktober Tag der Deutschen Einheit? > Passwort: Ia3OTdDE?</p>"
        },

        {
          "name": "Spiel zur Merkhilfe",
          "type": "1",
          "content": "https://app.Lumi.education/run/bYqQPw"
        },
        {
          "name": "Abschlussquiz",
          "type": "4",
          "content": "https://app.Lumi.education/run/Wr6AFa"
        }
      ]
    },
    {
      "description": "Du weißt schon wie du Passwörter erstellst und wozu sie da sind. Aber wie kannst du sie schützen?",
      "imgLink": "https://fpmedia.at/master/password2.png",
      "name": "Wie kann ich meine Passwörter schützen?",
      "pageID": "3deaa962-3820-4484-b160-169d7bc94348",
      "owner": "teacher2",
      "writer": ["teacher1"],
      "reader": ["teacher3", "student2", "student3"],
      "content": [
        {
          "content": "<p>In diesem Kurs lernst du, wie du deine Passwörter mithilfe eines Passwort-Managers speichern und verwenden kannst. Außerdem werden wir einige Gefahren, die im Zusammenhang mit Passwörtern bestehen, genauer erkunden. Zu Beginn machen wir allerdings ein kleines Quiz, um zu sehen, was du denn schon alles über Passwörter weißt.</p>",
          "contentID": "f6b51fce-6540-4094-89a6-937883e8eac0",
          "name": "Was erwartet dich in diesem Kurs",
          "type": "1"
        },
        {
          "content": "",
          "contentID": "17496da1-14bb-48f7-a312-b19bbe7ee251",
          "name": "Was weißt du schon über Passwörter?",
          "type": "4"
        },
        {
          "content": "<p>Ein Passwort-Manager ist ein Computerprogramm oder eine App, die dir hilft, deine Passwörter sicher aufzubewahren. Statt sich alle deine Passwörter merken zu müssen, kannst du sie in einem Passwort-Manager speichern. Das bedeutet, dass du nur noch ein einziges Passwort brauchst, um auf alle deine anderen Passwörter zugreifen zu können.</p>",
          "contentID": "906df278-3d34-4166-a2f4-50dfe67645ab",
          "name": "Was ist ein Passwort-Manager",
          "type": "1"
        },
        {
          "content": "",
          "contentID": "8638f068-99cd-4e00-ac90-b54458e71d02",
          "name": "Passwort Memory",
          "type": "4"
        },
        {
          "content": "<p>Es ist sehr gut, dass und Passwort-Manager helfen, weil es schwer ist, sich viele Passwörter zu merken und es ist auch nicht sicher, sie irgendwo aufzuschreiben. Wenn jemand deine aufgeschriebenen Passwörter findet, kann er sie verwenden, um in deine Konten einzudringen. Mit einem Passwort-Manager brauchst du dir keine Sorgen darüber zu machen, dass jemand deine Passwörter findet oder stiehlt, weil sie verschlüsselt und sicher gespeichert sind.</p><p>Außerdem erstellt ein Passwort-Manager auch sichere und stark Passwörter für dich, wenn dir deine Ideen ausgehen. Diese Passwörter sin dann meistens so kompliziert, dass du die sonst nicht erstellen kannst oder würdest. Du kannst sie dir auch meistens nicht merken, das macht aber nichts, da diese Aufgabe dein Passwort-Manager übernimmt.</p><p>Kurz gesagt, ein Passwort-Manager hilft dir dabei, deine Passwörter sicher zu speichern und dir das merken und erstellen von vielen verschiedenen Passwörtern zu erleichtern.</p>",
          "contentID": "9ca260c7-7e2d-4cc5-8bb0-0ecc272e3f77",
          "name": "Was können Passwort-Manager noch?",
          "type": "1"
        },
        {
          "content": "",
          "contentID": "1081b2c8-63f9-4a29-9ee9-b7146cf4bcb8",
          "name": "Quiz Passwort Manager",
          "type": "4"
        },
        {
          "content": "<p>Neben relativ harmlosen Werbe-E-Mails und Kettenbriefen können weitaus gefährlichere E-Mails Ihren Posteingang überschwemmen. Es gibt auch finstere Leute, die versuchen, Ihr Passwort zu stehlen (von ebay, Amazon usw.). „Phishing“ heißt diese Art des Datendiebstahls. Kriminelle bedienen sich dabei eines einfachen Tricks: Sie verlangen unter einem Vorwand geheime Daten. Als Köder senden sie E-Mails, die scheinbar von Websites stammen, für die sie die Passwörter wissen wollen. Die E-Mail enthält Links, die direkt zu echten gefälschten Kopien bekannter Websites führen. Wenn ich klicke, kämpfe ich fast mit Haken. Auf der Landing-Website werden Sie aufgefordert, Ihre Daten einzugeben. Und boom – die Bösewichte haben es bereits und können es selbst verwenden. Natürlich können sie Daten „phishen“, die auch zum Geldverdienen verwendet werden können, wie z. B. Internet-Auktionshäuser, Bankkonten, Internet-Zahlungssysteme usw. Manche Leute mögen es es insbesondere.</p>",
          "contentID": "03083936-e4f5-462a-8d4a-bccabf8ec780",
          "name": "Gefahren für Passwörter - Phishing",
          "type": "1"
        },
        {
          "content": "",
          "contentID": "a4634beb-cb0c-49f8-aa8d-43f5fde30abb",
          "name": "Erkenne die Phishing Mails",
          "type": "4"
        },
        {
          "content": "<p>Längere Passwörter sind sicherer, weil sie schwerer zu erraten sind. Wenn ein Passwort kurz ist, gibt es nicht viele verschiedene Buchstaben oder Zahlen, die verwendet werden können, und es kann leicht von jemandem erraten werden, der es herausfinden will. Wenn das Passwort jedoch länger ist, gibt es viele mehr Möglichkeiten für Buchstaben und Zahlen, und es ist schwieriger für jemanden, es zu erraten.</p><p>Es ist wichtig, dass dein Passwort lang genug ist und aus einer Kombination von Buchstaben, Ziffern und Sonderzeichen besteht, damit es schwieriger für jemanden ist, es zu erraten und damit es sicher bleibt.</p>",
          "contentID": "89650385-856f-43ef-a11d-88e0b78ef0f0",
          "name": "Warum sind länger Passwörter sicher?",
          "type": "1"
        },
        {
          "content": "<p>Bösewichte, die dein Passwort stehlen wollen, überlegen aber nicht nur selbst, welches Passwort du verwendest haben könntest. Manchmal probieren sie auch einfach viele Passwörter durch.&nbsp;</p><p>Natürlich dauert es für eine Person sehr lange, alle möglichen Passwort-Kombinationen durchzuprobieren. Für einen Computer ist das allerdings ein Kinderspiel.</p><p>Stell dir zum Beispiel ein 4-stelliges Passwort vor, dass nur aus Ziffern besteht, wie bei einem Handy. Für so ein Passwort gibt es 10.000 verschiedene Möglichkeiten. Für dich würde es sehr lange dauern, alle Kombinationen zu probieren. Ein Computer benötigt dafür allerdings im Durchschnitt nur 6 Minuten, bis er das richtige Passwort erraten hat.</p>",
          "contentID": "7a2a8415-7741-4dd5-844f-09cda2c10e4f",
          "name": "Passwörter erraten",
          "type": "1"
        },
        {
          "content": "",
          "contentID": "7c874e41-c142-45dd-b0f8-5f8f255526ab",
          "name": "Wie lange sollte ein Passwort sein?",
          "type": "4"
        },
        {
          "content": "<p>Wie du siehst, gibt es für Passwörter sehr viele Gefahren und man ist nie zu 100 % sicher. Wenn du die gelernten Tipps und Tricks anwendest, bist du allerdings schon sehr gut gegen viele Gefahren geschützt.</p><p>Zum Abschluss kannst du noch ein Quiz machen, dass all dein gelerntes Wissen über Passwörter auf die Probe stellt.</p>",
          "contentID": "48c0b615-c605-4ec5-8f14-45478e72033a",
          "name": "Viele Gefahren - aber du bist gerüstet",
          "type": "1"
        }
      ]
    }
  ]
}
